tutorials/combustion/fireFoam/LES/simplePMMApanel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication topoSet
runApplication extrudeToRegionMesh -overwrite
runApplication $(getApplication)

paraFoam -touchAll

#------------------------------------------------------------------------------
